Autodesk.Revit.DB.Visual.AdvancedMetal.SurfaceNdfType
The property labeled "NDF" from the "AdvancedMetal" schema.
Remarks:
This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "SurfaceNdfType".
Since:
2018.1

Autodesk.Revit.DB.Visual.AdvancedMetal.SurfaceRoughness
The property labeled "Roughness" from the "AdvancedMetal" schema.
Remarks:
This property is of type "AssetPropertyDouble".
This property allows a connected asset.
Since:
2018.1

Autodesk.Revit.DB.Visual.AdvancedMetal.SurfaceRotation
The property labeled "Rotation" from the "AdvancedMetal" schema.
Remarks:
This property is of type "AssetPropertyDouble".
This property allows a connected asset.
Since:
2018.1

Autodesk.Revit.DB.Visual.AdvancedMetal.SurfaceCutout
The property labeled "Image" from the "AdvancedMetal" schema.
Remarks:
This property is of type "AssetPropertyReference" and will only contain a reference to a connected image.
Since:
2018.1

Autodesk.Revit.DB.Visual.AdvancedMetal.SurfaceNormal
The property labeled "Image" from the "AdvancedMetal" schema.
Remarks:
This property is of type "AssetPropertyReference" and will only contain a reference to a connected image.
Since:
2018.1

Autodesk.Revit.DB.Visual.AdvancedMetal.SurfaceAnisotropy
The property labeled "Anisotropy" from the "AdvancedMetal" schema.
Remarks:
This property is of type "AssetPropertyDouble".
This property allows a connected asset.
Since:
2018.1

Autodesk.Revit.DB.Visual.AdvancedMetal.SurfaceAlbedo
The property labeled "Color" from the "AdvancedMetal" schema.
Remarks:
This property is of type "AssetPropertyDoubleArray4d".
This property allows a connected asset.
Since:
2018.1

Autodesk.Revit.DB.Visual.AdvancedMetal.MetalF0
The property labeled "Reflectance" from the "AdvancedMetal" schema.
Remarks:
This property is of type "AssetPropertyDoubleArray4d".
This property allows a connected asset.
Since:
2018.1

Autodesk.Revit.DB.Visual.AdvancedMetal
A static class that provides access to the property names that appear in the AdvancedMetal visual asset schema.
Since:
2018.1